test/data/xml/axis/GetDynamicDNS.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl" 
  xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>root</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">nb2No6O9ZDDkOKBZjgp5LYndpN0=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">aYG/Ieg6ff3k62KEpYr96A==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-17T15:03:41.746Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <tds:GetDynamicDNS/>
  </s:Body>
</s:Envelope>